# Tf Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..Tf Property
SymbolTypeId Class See Also
---
Symbol Tf, indicating unit Tonnes force.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId Tf { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Tf As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Tf {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace